'use strict';

(function () {
  window.data = {
    ESC_KEYCODE: 27,
    ENTER_KEYCODE: 13,

    AMOUNT_IMAGES: 25,
    LIKES_MIN: 15,
    LIKES_MAX: 200,

    AMOUNT_AVATARS: 6,
    NAMES: [
      'Артем',
      'Рома',
      'Эльдар',
      'Мухамед',
      'Вероника',
      'Аркадий',
      'Кекс',
      'Дима',
      'Борис',
      'Толик'
    ],

    MESSAGES: [
      'Всё отлично!',
      'В целом всё неплохо. Но не всё.',
      'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
      'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
      'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
      'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!'
    ],

    AMOUNT_COMMENTS: 10,
    DESCRIPTIONS: [
      'Класная фотка!',
      'Хороший ракурс',
      'Удачный кадр',
      'Нужно закинуть в Инстаграмм',
      'Эту фотку нужно удалить',
      'Крутяк WOW! WOW!'
    ],

    SCALE_MAX: 100,
    SCALE_MIN: 25,
    SCALE_STEP: 25,

    PIN_POSITION_MAX: 100,
    PIN_POSITION_MIN: 0,

    MESSAGE_LEN_MAX: 2,
    MESSAGE_LEN_MIN: 1,

    TAG_LEN_MAX: 20,
    TAG_MAX: 5,
  };
})();
